БухЭксп/InformationRegisters/CW_ХарактеристикиДоговоровИПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиДоговоровИПриложений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиДоговоровИПриложений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьХарактиристикиОбъекта(Объект) Экспорт

Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ХарактеристикиДоговоровИПриложений.Параметр КАК Параметр,
	               |	CW_ХарактеристикиДоговоровИПриложений.Значение КАК Значение,
	               |	ВЫБОР
	               |		КОГДА CW_ХарактеристикиДоговоровИПриложений.Параметр.ЭтоКонтрольнаяДата
	               |			ТОГДА 2
	               |		КОГДА CW_ХарактеристикиДоговоровИПриложений.Параметр.ДинамическийПараметр
	               |			ТОГДА 3
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ИндексКартинки,
	               |	CW_ХарактеристикиДоговоровИПриложений.Порядок КАК Порядок,
	               |	CW_ХарактеристикиДоговоровИПриложений.Параметр.ОграниченСпискомЗначений КАК ОграниченСпискомЗначений
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиДоговоровИПриложений КАК CW_ХарактеристикиДоговоровИПриложений
	               |ГДЕ
	               |	CW_ХарактеристикиДоговоровИПриложений.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура ЗаписатьЗначенияПараметровВРегистр(Объект, ДополнительныеХарактеристики) Экспорт
	
	НаборПараметров = РегистрыСведений.CW_ХарактеристикиДоговоровИПриложений.СоздатьНаборЗаписей();
	НаборПараметров.Отбор.Объект.Установить(Объект);
	
	Для Каждого СтрокаПараметров из ДополнительныеХарактеристики Цикл
		СтрокаНабора = НаборПараметров.Добавить();
		СтрокаНабора.Объект 	= Объект;
		СтрокаНабора.Параметр 	= СтрокаПараметров.Параметр;
		СтрокаНабора.Значение 	= СтрокаПараметров.Значение;
		
		СтрокаНабора.Порядок    = ДополнительныеХарактеристики.Индекс(СтрокаПараметров);
	КонецЦикла;
	
	НаборПараметров.Записать(Истина);
	
КонецПроцедуры

#КонецЕсли
